# 0316 Pandas 연습문제 과제

## 1. Titanic - sns.load_dataset('titanic')

In [1]:
import numpy as np 
import pandas as pd

In [3]:
import matplotlib as mpl 
import matplotlib.pyplot as plt 
%matplotlib inline

mpl.rcParams['axes.unicode_minus'] = False   # minus 표시
mpl.rcParams["font.family"] = 'Malgun Gothic'

In [5]:
import seaborn as sns

In [21]:
titanic = sns.load_dataset('titanic')    # Titanic 데이터

### a.타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨
- 1)20살이 넘으면 성별을 그대로 사용한다.
- 2)20살 미만이면 성별에 관계없이 “child”라고 한다.

In [22]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
titanic['category1'] = titanic.apply(lambda r : r.sex if r.age > 20 else 'child', axis=1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male

### b.타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오.

In [42]:
mean_age = titanic.loc[:,['age']].fillna(titanic['age']).mean()
mean_age

age    29.699118
dtype: float64

In [44]:
titanic['age'] = na_values.['mean_age']          ## 모르겠음.
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,29.699118,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,29.699118,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,29.699118,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,29.699118,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,29.699118,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male

### c.성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

In [66]:
df1.pivot_table("fare", ["sex","class"], "embark_town")

embark_town     Cherbourg  Queenstown  Southampton
sex    class
female First   115.640309   90.000000    99.026910
       Second   25.268457   12.350000    21.912687
       Third    14.694926   10.307833    18.670077
male   First    93.536707   90.000000    52.949947
       Second   25.421250   12.350000    19.232474
       Third     9.352237   11.924251    13.307149

## 2. Mile Per Gallon - sns.load_dataset('mpg')

In [13]:
mpg = sns.load_dataset("mpg")    # Mile Per Gallon 데이터

In [15]:
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

### a.배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.

In [6]:
mpg['hp_per_cc'] = mpg.apply(lambda x : x.displacement - x.horsepower, axis=1)
mpg

NameError: name 'mpg' is not defined

### b.name으로부터 manufacturer(제조사)와 모델을 추출하여 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.

In [ ]:
mpg['hp_per_cc'] = mpg.apply(lambda x : x.displacement - x.horsepower, axis=1)
mpg

### c.엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.

### d.생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.

### e.모델이 5개 이상인 제조사에 대하여 연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.